Revit 2027 API
MemberForces.Force Property
 The translational forces at relative point position of the element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Force { get; set; }
Public Property Force As XYZ
	Get
	Set
public:
property XYZ^ Force {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Force : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The x value of XYZ object represents moment about x-axis of the analytical element coordinate system, y about y-axis, z about z-axis respectively.
See Also
Reference
MemberForces Class
Autodesk.Revit.DB.Structure Namespace